DataProcessors/umk_СформироватьНалоговыеНакладные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>umk_СформироватьНалоговыеНакладные</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ОжидаемыйИПодтвержденныйНДСПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>ОжидаемыйИПодтвержденныйНДСПродаж</Name>
			<Comment>(Регл) </Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БазаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийОжидаемыйИПодтвержденныйНДСПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаОтПокупателяПлатежнойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.ГТДИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВозвратнаяТара</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СобытиеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияОжидаемыйИПодтвержденныйНДСПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/РасчетыВозврат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>РасчетыВозврат</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Расчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВедениеВзаиморасчетовПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВедениеВзаиморасчетовПоДоговорам</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДоговоруВЦелом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПоРасчетнымДокументам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСчетам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийНалоговаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОперацийНалоговаяНакладная</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОблагаемыеОперации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсвобожденныеОперации</Name>
					<Comment>Операции, освобожденные от НДС (п.5)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНДСОперации</Name>
					<Comment>Операции, не объекты налогообложения по НДС (п. 3.2)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИтоговаяРозницаОблагаемыеОперации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИтоговаяРозницаОсвобожденныеОперации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозницаКонрагентуОблагаемыеОперации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозницаКонрагентуОсвобожденныеОперации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УсловнаяПродажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаботыОтНерезидента</Name>
					<Comment>Работы, полученные от нерезидента</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УсловнаяПродажаСписаниеОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводнаяНаПревышениеБазыНадЦенойПоставки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>(Общ) Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС14</Name>
					<Comment>(Общ) Ставка НДС 14%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>(Общ) Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/umk_СформироватьНалоговыеНакладные/Ext/ObjectModule.bsl
//Процедуры формирующие налоговые накладные
Процедура СформироватьНН(Основание)
	
	ТипОснования = ТипЗнч(Основание);
	
	Если ЕстьСформированныеНН(Основание) Тогда
		Возврат
	КонецЕсли;
	
	// Проверим	первое событие
	СтруктураОбязательств = ПолучитьБазуСумму(Основание);
	
	Если СтруктураОбязательств.База = 0 ИЛИ СтруктураОбязательств.База < 0.05 Тогда
		Возврат; // Нет первого события
	КонецЕсли;

	

	 
	ОбработкаФормированияНН = Обработки.umk_ФормированиеНалоговыхНакладных.Создать();

	
	ОбработкаФормированияНН.мДокументВводаНаОсновании 	= Основание;
	ОбработкаФормированияНН.Дата						= Основание.Дата;
	
	Если НЕ ЗначениеЗаполнено(Основание.Организация) Тогда
		Сообщить("В документе не указана организация! Заполнение невозможно.");
		Возврат;
	Иначе
		ОбработкаФормированияНН.Организация = Основание.Организация;
	КонецЕсли;
	
	// Основание может содержать номенклатуру для заполнения налоговой накладной
	ОснованиеСодержитНоменклатуру = Ложь;
  	Для каждого ДопустимыйТип Из ОбработкаФормированияНН.ДопустимыеТипыДокументов Цикл
		Если ТипОснования = ДопустимыйТип Тогда
			ОснованиеСодержитНоменклатуру = Истина;
			Прервать;
  		КонецЕсли;
   	КонецЦикла; 

	ОтборДоговоров = Новый ТаблицаЗначений;
	ОтборДоговоров.Колонки.Добавить("РасчетыВозврат");
	ОтборДоговоров.Колонки.Добавить("ДоговорКонтрагента");
	ОтборДоговоров.Колонки.Добавить("Сделка");                                           
	ОтборДоговоров.Колонки.Добавить("Дата", 		Новый ОписаниеТипов("Дата"));	
	ОтборДоговоров.Колонки.Добавить("ЗаТару", 		Новый ОписаниеТипов("Булево"));
	ОтборДоговоров.Колонки.Добавить("СтавкаНДС", 	Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	
	Если ОснованиеСодержитНоменклатуру Тогда
		
		Если НЕ ЗначениеЗаполнено(Основание.ДоговорКонтрагента) Тогда
			
			Сообщить("В документе не указан договор контрагента! Заполнение невозможно.");
			Возврат;
			
		КонецЕсли;	
			
		СтрокаОтбора 					= ОтборДоговоров.Добавить();
		
		СтрокаОтбора.ДоговорКонтрагента = Основание.ДоговорКонтрагента;
		СтрокаОтбора.РасчетыВозврат		= Перечисления.РасчетыВозврат.Расчеты;
		СтрокаОтбора.Дата               = Основание.Дата;
		
		Если     ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПокупателю")
			 ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			
			СделкаНалоговыйУчет  = Основание;	
			Если  Основание.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам 
				И ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
				
				СделкаНалоговыйУчет = Основание.ЗаказПокупателя;
				
			КонецЕсли;			
			
			СтрокаОтбора.Дата 	 = '00010101';	
			ОбработкаФормированияНН.Дата = '00010101';	
			
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
				
			СделкаНалоговыйУчет = Основание.СделкаПоРеализации;
			// налоговые обязательства - по оплате
			СтрокаОтбора.Дата 	 		 = '00010101';	
			ОбработкаФормированияНН.Дата = '00010101';	
				
		Иначе
					
			СделкаНалоговыйУчет = Основание.Сделка;	
					
		КонецЕсли;
					
		Если    Основание.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
			
			СтрокаОтбора.Сделка = СделкаНалоговыйУчет;
			
			
		ИначеЕсли Основание.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда
			// возможно указание заказов в табличной части.		
			СтрокаОтбора.Сделка = СделкаНалоговыйУчет;
			 
			Если ОбработкаФормированияНН.мОтбиратьНоменклатуруПоЗаказам Тогда
				
				ОтборДоговоров.Удалить(СтрокаОтбора);
				
				МетаданныеОснования = Основание.Метаданные();
				
				МассивЗаказов = Новый Массив;
				Для каждого ТЧОснования Из МетаданныеОснования.ТабличныеЧасти Цикл
					Если НЕ (ТЧОснования.Реквизиты.Найти("ЗаказПокупателя") = Неопределено) Тогда
						Для каждого СтрокаТЧ Из Основание[ТЧОснования.Имя] Цикл
							МассивЗаказов.Добавить(СтрокаТЧ.ЗаказПокупателя);
						КонецЦикла;
					ИначеЕсли ЗначениеЗаполнено(СделкаНалоговыйУчет) Тогда
						МассивЗаказов.Добавить(СделкаНалоговыйУчет);
					КонецЕсли;						
				КонецЦикла;
				МассивЗаказов = УчетНДС.УдалитьПовторяющиесяЭлементыМассива(МассивЗаказов);				
				
				Для каждого Заказ Из МассивЗаказов Цикл
				
					СтрокаОтбора = ОтборДоговоров.Добавить();
					СтрокаОтбора.РасчетыВозврат		= Перечисления.РасчетыВозврат.Расчеты;
					СтрокаОтбора.ДоговорКонтрагента = Основание.ДоговорКонтрагента;
					СтрокаОтбора.Сделка 			= Заказ;
					Если     ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПокупателю")
						 ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя")
						 ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
                        СтрокаОтбора.Дата 				= '00010101';
					Иначе
						СтрокаОтбора.Дата 				= Основание.Дата;
					КонецЕсли;
				
				КонецЦикла;				
			КонецЕсли;			
					
		ИначеЕсли НЕ Основание.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентомРегл 
			     ИЛИ Основание.ДоговорКонтрагента.СложныйНалоговыйУчет Тогда
			// по расч. док. + слож. налоговый учет
			СтрокаОтбора.Сделка = Неопределено;
					
		Иначе
			
			Если     ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПокупателю")
				 ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				 
				Сообщить("Взаиморасчеты ведутся по расчетным документам! Заполнение на основании Счета (заказа) невозможно.");
				Возврат;
				 
			Иначе
				 
				СтрокаОтбора.Сделка = Основание;
				
				Если ОбщегоНазначения.ЕстьТабЧастьДокумента("ДокументыРасчетовСКонтрагентом", Основание.Метаданные()) Тогда
					
					Для каждого СтрокаДокРасчетов Из Основание.ДокументыРасчетовСКонтрагентом Цикл
					
						// по документу может быть два "первых события" по расчетному документу и по ссылке.
						СтрокаОтбора = ОтборДоговоров.Добавить();
						СтрокаОтбора.РасчетыВозврат		= Перечисления.РасчетыВозврат.Расчеты;
						СтрокаОтбора.ДоговорКонтрагента = Основание.ДоговорКонтрагента;
						СтрокаОтбора.Сделка 			= СтрокаДокРасчетов.ДокументРасчетовСКонтрагентом;
						СтрокаОтбора.Дата 				= Основание.Дата;
					
					КонецЦикла;
				
				КонецЕсли;
					
			КонецЕсли;
				
		КонецЕсли;
			
	Иначе
		
	   Если НЕ Основание.Метаданные().ТабличныеЧасти.Найти("РасшифровкаПлатежа") = Неопределено Тогда
				
			// платежные документы
			Для каждого СтрокаТЧ Из Основание.РасшифровкаПлатежа  Цикл
				СтрокаОтбора = ОтборДоговоров.Добавить();
									
				СтрокаОтбора.РасчетыВозврат		= Перечисления.РасчетыВозврат.Расчеты;
				СтрокаОтбора.ДоговорКонтрагента = СтрокаТЧ.ДоговорКонтрагента;
				СтрокаОтбора.Дата 				= Основание.Дата;
					
				СделкаНалоговыйУчет 			= СтрокаТЧ.Сделка;	
					
				Если    СтрокаТЧ.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам
					ИЛИ СтрокаТЧ.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда
					
					СтрокаОтбора.Сделка = СделкаНалоговыйУчет
					
				ИначеЕсли НЕ Основание.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентомРегл 
					     ИЛИ Основание.ДоговорКонтрагента.СложныйНалоговыйУчет Тогда
					// по расч. док. + слож. налоговый учет
					СтрокаОтбора.Сделка = Неопределено;
					
				Иначе
					
					СтрокаОтбора.Сделка = СтрокаТЧ.ДокументРасчетовСКонтрагентом;
					
					// добавим еще строку по ссылке - по ней тоже может быть 1-е событие
					СтрокаОтбора = ОтборДоговоров.Добавить();
					СтрокаОтбора.РасчетыВозврат		= Перечисления.РасчетыВозврат.Расчеты;
					СтрокаОтбора.ДоговорКонтрагента = СтрокаТЧ.ДоговорКонтрагента;
					СтрокаОтбора.Сделка 			= Основание;
					СтрокаОтбора.Дата 				= Основание.Дата;
						
				КонецЕсли;
					
			КонецЦикла;
			
			ОтборДоговоров.Свернуть("Сделка, ДоговорКонтрагента, РасчетыВозврат, Дата, Затару, СтавкаНДС","");
			
		Иначе
			
		//	Сообщить("В документе не указан договор контрагента! Заполнение невозможно.");
			Возврат;
				
		КонецЕсли;		
		
	КонецЕсли;

	// получим данные регистра ОжидаемыйИПодтвержденныйНДСПродаж на текущий момент
	ОбработкаФормированияНН.ОбновитьДоговора(ОтборДоговоров);
	
	// укажем номенклатурный состав
	Для каждого СтрокаОтбора Из ОтборДоговоров Цикл
		
		ДокументИсточникНоменклатуры = Неопределено;
	
		Если ОснованиеСодержитНоменклатуру Тогда
				
			ДокументИсточникНоменклатуры = Основание; 	
				
		Иначе
				
			СделкаСодержитНоменклатуру = Ложь;
				
			Для каждого ДопустимыйТип Из ОбработкаФормированияНН.ДопустимыеТипыДокументов Цикл
				Если ТипЗнч(СтрокаОтбора.Сделка) = ДопустимыйТип Тогда
					СделкаСодержитНоменклатуру = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
				
			Если СделкаСодержитНоменклатуру Тогда
				ДокументИсточникНоменклатуры = СтрокаОтбора.Сделка;
			КонецЕсли;
				
		КонецЕсли;
						
		СтруктураОтбора = Новый Структура();
		СтруктураОтбора.Вставить("Документ", 			ДокументИсточникНоменклатуры);
		СтруктураОтбора.Вставить("ДоговорКонтрагента", 	СтрокаОтбора.ДоговорКонтрагента);
		СтруктураОтбора.Вставить("Сделка", 				СтрокаОтбора.Сделка);
		СтруктураОтбора.Вставить("РасчетыВозврат", 		СтрокаОтбора.РасчетыВозврат);
		СтруктураОтбора.Вставить("Дата", 				СтрокаОтбора.Дата);
		
		Если НЕ ДокументИсточникНоменклатуры = Неопределено Тогда
			
			СтрокаИсточниковНоменклатуры = ОбработкаФормированияНН.ИсточникиНоменклатуры.Добавить();
			СтрокаИсточниковНоменклатуры.Документ 			= ДокументИсточникНоменклатуры;
			СтрокаИсточниковНоменклатуры.ДоговорКонтрагента = СтрокаОтбора.ДоговорКонтрагента;
			СтрокаИсточниковНоменклатуры.Сделка 			= СтрокаОтбора.Сделка;
			СтрокаИсточниковНоменклатуры.РасчетыВозврат 	= СтрокаОтбора.РасчетыВозврат;
			СтрокаИсточниковНоменклатуры.Дата			 	= СтрокаОтбора.Дата;
				
			ОбработкаФормированияНН.ЗаполнитьТабличныеЧасти(СтруктураОтбора);
			
		КонецЕсли;
			
	КонецЦикла;	
	
	МожноФормироватьНалоговыеНакладные  = Истина;
	БудутСформированыНалоговыеНакладные = Истина;

	// Проверим, можно ли не открывать форму обработки для корректировок
	Для каждого СтрокаОтбора Из ОтборДоговоров Цикл
						
		СтруктураОтбора = Новый Структура();
		СтруктураОтбора.Вставить("ДоговорКонтрагента", 	СтрокаОтбора.ДоговорКонтрагента);
		СтруктураОтбора.Вставить("Сделка", 				СтрокаОтбора.Сделка);
		СтруктураОтбора.Вставить("РасчетыВозврат", 		СтрокаОтбора.РасчетыВозврат);
		СтруктураОтбора.Вставить("Дата", 				СтрокаОтбора.Дата);
		
		ТаблицаЧастичнойОтгрузки = Неопределено;
		ОбязательствБольшеЧемНоменклатуры = ОбработкаФормированияНН.МожноФормироватьНалоговыеНакладные(СтруктураОтбора, ТаблицаЧастичнойОтгрузки);
		
		Если  ТаблицаЧастичнойОтгрузки.Количество() = 0 Тогда
			
			// вообще нет номенклатуры для заполнения
			МожноФормироватьНалоговыеНакладные = Ложь;
			Прервать;
			
		ИначеЕсли НЕ ОбязательствБольшеЧемНоменклатуры Тогда                     
			
			МожноФормироватьНалоговыеНакладные  = Ложь;
			
			// есть номенклатурный состав для заполнения
			Если НЕ ОбработкаФормированияНН.БудутСформированыНалоговыеНакладные(ТаблицаЧастичнойОтгрузки) Тогда
				
				БудутСформированыНалоговыеНакладные = Ложь;
				
			КонецЕсли;
			
			Прервать;
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	
	Если МожноФормироватьНалоговыеНакладные Тогда
			
	ИначеЕсли НЕ БудутСформированыНалоговыеНакладные Тогда
				  
		Возврат;
							
	Иначе

		Если  ОтборДоговоров.Количество() = 1 И (ДокументИсточникНоменклатуры = Неопределено) 
			И ТипЗнч(Основание) = Тип("ДокументСсылка.ПлатежноеПоручениеВходящее") Тогда // аванс без сделки
			
			//// Создадим НН по авансу без сделки + umk
			//СтруктураОбязательств = ПолучитьБазуСумму(Основание);
			//
			//Если СтруктураОбязательств.База = 0 ИЛИ СтруктураОбязательств.База < 0.05 Тогда
			//	Возврат; // Нет первого события
			//КонецЕсли;
			
			НалоговаяНакладная = Документы.НалоговаяНакладная.СоздатьДокумент();
			ЗаполнитьЗначенияСвойств(НалоговаяНакладная, Основание,,"Проведен, Номер, Ответственный");
			НалоговаяНакладная.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОблагаемыеОперации;
			НалоговаяНакладная.ДокументОснование = Основание;
			НалоговаяНакладная.УчитыватьНДС = Истина;
			НалоговаяНакладная.КурсВзаиморасчетов = 1;
			НалоговаяНакладная.КратностьВзаиморасчетов = 1;
			НалоговаяНакладная.СчетУчетаНДС = ПланыСчетов.Хозрасчетный.НалоговыеОбязательстваНеподтвержденные;
			НалоговаяНакладная.СчетНДС = ПланыСчетов.Хозрасчетный.РасчетыПоНДС;
			НалоговаяНакладная.Комментарий = "Частичная оплата";
			
			
			СтрокаТовары = НалоговаяНакладная.Товары.Добавить();
			СтрокаТовары.Номенклатура 		= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "НоменклатураДляЗаполненияНалоговыхНакладных");;
			СтрокаТовары.Количество = 1;
			СтруктураОбязательств = ПолучитьБазуСумму(Основание); 
			СтрокаТовары.Цена =  СтруктураОбязательств.База;
			СтрокаТовары.СуммаНДС = СтруктураОбязательств.НДС;
			СтрокаТовары.ЕдиницаИзмерения 	= СтрокаТовары.Номенклатура.ЕдиницаХраненияОстатков;
			СтрокаТовары.Коэффициент	 	= СтрокаТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент;
			СтрокаТовары.СтавкаНДС 		= Перечисления.СтавкиНДС.НДС20;
			// Рассчитать реквизиты табличной части.
			ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТовары, НалоговаяНакладная);
			
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТовары, НалоговаяНакладная);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТовары, НалоговаяНакладная);
			НалоговаяНакладная.ЗаполнитьСтатьюДекларацииНДСНалоговыеОбязательства(СтрокаТовары,"Товары");
			
			
			НалоговаяНакладная.Записать();
			//Возврат; - umk
			
		КонецЕсли;

			Если  ОтборДоговоров.Количество() = 1 И (НЕ ДокументИсточникНоменклатуры = Неопределено) Тогда
							// открываем НН заполненную строками "частичная отгрузка"
				СтруктураОтбора.Вставить("Документ", ДокументИсточникНоменклатуры);
				
				ОбработкаФормированияНН.ПодготовитьНоменклатурныйСоставПриЧастичнойОтгрузке(СтруктураОтбора, ТаблицаЧастичнойОтгрузки);
				ОбработкаФормированияНН.ОткрыватьДокументы = Истина;
				ОбработкаФормированияНН.СформироватьНалоговыеДокументы();
				
					
				Возврат;	
				
			КонецЕсли; 

	КонецЕсли;
	
	// сюда мы попадаем только, если по всем договорам можно сформировать налоговые накладные
	Если МожноФормироватьНалоговыеНакладные Тогда
				
		ОбработкаФормированияНН.ОткрыватьДокументы = Ложь;
				
		// сформированные документы не будут записаны в базу
		ОбработкаФормированияНН.мНеЗаписыватьДокументы = Ложь;
		ОбработкаФормированияНН.ПроводитьДокументы     = Ложь;
				
		ОбработкаФормированияНН.СформироватьНалоговыеДокументы();	
		Возврат;	

	КонецЕсли;	
	
	// необходимо подкорректировать номенклатурный состав.
	// откроем обработку. Но в ТЧ Договора может не быть строк - если остатков по регистру НДСПродаж не текущий момент нет
	// Добавим строки при необходимости
	Для каждого СтрокаОтбораДоговоров Из ОтборДоговоров Цикл
		
		Если ОбработкаФормированияНН.Договора.НайтиСтроки(Новый Структура("ДоговорКонтрагента, Сделка",СтрокаОтбораДоговоров.ДоговорКонтрагента,СтрокаОтбораДоговоров.Сделка)).Количество() = 0 Тогда
			
			СтрокаДоговоров = ОбработкаФормированияНН.Договора.Добавить();
			СтрокаДоговоров.ДоговорКонтрагента 	= СтрокаОтбораДоговоров.ДоговорКонтрагента;
			СтрокаДоговоров.Сделка 				= СтрокаОтбораДоговоров.Сделка;
			СтрокаДоговоров.РасчетыВозврат 		= СтрокаОтбораДоговоров.РасчетыВозврат;
			СтрокаДоговоров.Дата 				= СтрокаОтбораДоговоров.Дата;

			
			СтрокаИсточниковНоменклатуры = ОбработкаФормированияНН.ИсточникиНоменклатуры.Добавить();
			СтрокаИсточниковНоменклатуры.ДоговорКонтрагента 	= СтрокаОтбораДоговоров.ДоговорКонтрагента;
			СтрокаИсточниковНоменклатуры.Сделка 				= СтрокаОтбораДоговоров.Сделка;
			СтрокаИсточниковНоменклатуры.РасчетыВозврат 		= СтрокаОтбораДоговоров.РасчетыВозврат;
			СтрокаИсточниковНоменклатуры.Дата 					= СтрокаОтбораДоговоров.Дата;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	ФормаОбоработки =  ОбработкаФормированияНН.ПолучитьФорму();
	ФормаОбоработки.ВосстанавливатьЗначенияПриОткрытии = Ложь;
	ФормаОбоработки.ОткрыватьДокументы = Ложь;
	//ФормаОбоработки.Открыть();
	ФормаОбоработки.ЭлементыФормы.Панель.ТекущаяСтраница = ФормаОбоработки.ЭлементыФормы.Панель.Страницы.Данные;
		
	
	
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОтобратьДокументы(ДатаНачала, ДатаОкончания)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслуг.Дата КАК Дата
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПлатежноеПоручениеВходящее.Ссылка,
		|	ПлатежноеПоручениеВходящее.Дата
		|ИЗ
		|	Документ.ПлатежноеПоручениеВходящее КАК ПлатежноеПоручениеВходящее
		|ГДЕ
		|	ПлатежноеПоручениеВходящее.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";

	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ДокументСсылка = ВыборкаДетальныеЗаписи.Ссылка;
		
		СформироватьНН(ДокументСсылка);
		
	КонецЦикла;
    

КонецПроцедуры

Функция ЕстьСформированныеНН(Основание)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НалоговаяНакладная.Ссылка
		|ИЗ
		|	Документ.НалоговаяНакладная КАК НалоговаяНакладная
		|ГДЕ
		|	НалоговаяНакладная.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И НалоговаяНакладная.ПометкаУдаления = ЛОЖЬ
		|	И НалоговаяНакладная.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Основание.Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Основание.Дата));
	Запрос.УстановитьПараметр("ДокументОснование", Основание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() 
		Тогда
		#Если Клиент Тогда
			Сообщить("Для документа " + Строка(Основание)  + " существует налоговая накладная " + Выборка.ссылка);	
		#КонецЕсли
		Возврат Истина
	Иначе
		Возврат Ложь
	КонецЕсли;
	
КонецФункции

Функция ПолучитьБазуСумму(Основание)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОжидаемыйИПодтвержденныйНДСПродажОбороты.СуммаНДСПриход КАК НДС,
		|	ОжидаемыйИПодтвержденныйНДСПродажОбороты.БазаНДСПриход КАК База
		|ИЗ
		|	РегистрНакопления.ОжидаемыйИПодтвержденныйНДСПродаж.Обороты(, , Регистратор, ) КАК ОжидаемыйИПодтвержденныйНДСПродажОбороты
		|ГДЕ
		|	ОжидаемыйИПодтвержденныйНДСПродажОбороты.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", Основание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Структура = Новый Структура();
	
	Если Выборка.Следующий() Тогда
		
		Структура.Вставить("НДС", Выборка.НДС);
		Структура.Вставить("База", Выборка.База);
		
	Иначе
		
		Структура.Вставить("НДС", 0);
		Структура.Вставить("База", 0);
		
	КонецЕсли;
	
	Возврат Структура
	 	
КонецФункции
